astb_relise/src/DataProcessors/ВыгрузкаОстатковXML/ВыгрузкаОстатковXML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаОстатковXML</name>
  <attributes>
    <name>ДатаОстатков</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Путь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

astb_relise/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроцентИзноса</name>
    <type>
      <types>CatalogRef.ПроцентыИзноса</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/DataProcessors/ВыгрузкаОстатковXML/Forms/Форма/Module.bsl
&НаСервере
Процедура ВыгрузитьНаСервере(ДатаОстатков, Поставщики)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура.КодСинхронизации КАК КодОра,
		|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры.Код КАК ХарактеристикаКод,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК Количество,
		|	ОстаткиНоменклатурыОстатки.Номенклатура.Наименование КАК Наименование
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(&ДатаОстатков, ) КАК ОстаткиНоменклатурыОстатки
		|ГДЕ
		|	ОстаткиНоменклатурыОстатки.Номенклатура.КодСинхронизации <> 0
		|	И ВЫБОР
		|			КОГДА &Кол > 0
		|				ТОГДА ОстаткиНоменклатурыОстатки.Номенклатура.Поставщик В (&Поставщики)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &КолСкладов > 0
		|				ТОГДА ОстаткиНоменклатурыОстатки.Склад В (&Склады)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодОра";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	Запрос.УстановитьПараметр("Поставщики", Поставщики);
	Запрос.УстановитьПараметр("Склады", Склады);
	Запрос.УстановитьПараметр("Кол", Поставщики.Количество());
	Запрос.УстановитьПараметр("КолСкладов", Склады.Количество());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стр = Остатки.Добавить();
		ЗаполнитьЗначенияСвойств(Стр,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	Остатки.Очистить();
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(Объект.Путь);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("root");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("date");
		ЗаписьXML.ЗаписатьТекст(Строка(Объект.ДатаОстатков));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ВыгрузитьНаСервере(Объект.ДатаОстатков, Поставщики);
	Для Каждого Стр из Остатки Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("tovar");
		ЗаписьXML.ЗаписатьАтрибут("ORA", Стр.КодОра);
		ЗаписьXML.ЗаписатьАтрибут("Name", Стр.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("Size", Стр.ХарактеристикаКод);
		ЗаписьXML.ЗаписатьАтрибут("Kol", Строка(Стр.Количество));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
		
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогСохраненияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'Файлы XML'") + "(*.xml)|*.xml|";
	ДиалогСохраненияФайла.Фильтр = Фильтр;
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь;


	Если ДиалогСохраненияФайла.Выбрать() Тогда  
		 Объект.Путь = ДиалогСохраненияФайла.ПолноеИмяФайла;	
	КонецЕсли;
КонецПроцедуры
